"""
Задача 14:
Требуется вывести все целые степени двойки 
(т.е. числа вида 2k), не превосходящие числа N.
"""

N = abs(int(input('Введите число N: ')))
a = 0
b = 2

for i in range(N):
    if a != 1:
        b = b ** i
        if b <= N:
            print(b, end = ' ')
            b = 2
        else:
            a = 1
    else:
        i = N


